Repository: francesc3000/trustvalueapp
Catalog: lib/src/localization/app_*.arb
Languages: ca, es

# whoHelpEnd
source: helps nonprofits to be more transparent with their donors and supporters
ca: ajuda a les entitats no lucratives a ser més transparents amb els seus donants i col·laboradors
es: ayuda a las entidades no lucrativas a ser más transparentes con sus donantes y colaboradores

# whoWeAre
source: We are specialists in traceability and thanks to Blockchain technology our data is 100% secure and truthful
ca: Som especialistes en traçabilitat i gràcies a la tecnologia *Blockchain les nostres dades són 100% segurs i veraços
es: Somos especialistas en trazabilidad y gracias a la tecnología Blockchain nuestros datos son 100% seguros y veraces

# whatWeDo
source: Pistis is our flagship product, it is a reliable, robust and easy to use application
ca: Pistis és el nostre producte estrella, és una aplicació fiable, robusta i fàcil d'usar
es: Pistis es nuestro producto estrella, es una aplicación fiable, robusta y fácil de usar

# sendUs
source: You can contact us via
ca: Ens pot contactar a través de
es: Puede contactarnos por

# topic
source: I have a question
ca: Tinc una pregunta
es: Tengo una pregunta

# productNameLabel
source: Name
ca: Nom
es: Nombre

# productModelLabel
source: Model
es: Modelo

# productBatchLabel
source: Batch
ca: Lot
es: Lote

# productSerialNLabel
source: Serial Number
ca: Numero de Serie
es: Número de Serie

# bomLabel
source: Bill of Materials
ca: Llista de Materials
es: Lista de Materiales

# bom1
source: Gunpowder
ca: Pólvora
es: Pólvora

# bom2
source: Wick
ca: Metxa
es: Mecha

# bom3
source: Steel
ca: Acer
es: Acero

# serviceNameLabel
source: Name
ca: Nom
es: Nombre

# serviceAmountLabel
source: Amount
ca: Quantitat
es: Cantidad

# trackLabel
source: Track
ca: Seguiment
es: Seguimiento

# fromLabel
source: From
ca: Des de
es: Desde

# toLabel
source: to
ca: cap a
es: hacia

# send2Pistis
source: Submit to Pistis
ca: Enviar a Pistis
es: Enviar a Pistis

# scanQR
source: You can scan the QR code or via the link
ca: Pots escanejar el codi *QR o a través de l'enllaç
es: Puedes escanear el código QR o a través del enlace

source: here
ca: aquí
es: aquí

# productName
source: Pistis Rocket
ca: Coet Pistis
es: Cohete Pistis

# slide0
source: Click Submit Button to start the Demo
ca: Pots pulsar Enviar per a començar la Demo
es: Pulsa sobre Enviar para empezar la Demo

# slide1
source: The product has been sent to Pistis and is being incorporated into the Blockchain.
ca: S'ha enviat el producte a Pistis i s'esta incorporant a la Blockchain
es: Se ha enviado el producto a Pistis y se esta incorporando a la Blockchain

# slide2
source: This means that your product information will remain unchanged forever
ca: Això vol dir que l'información del seu producte romandrà inalterable per sempre
es: Esto quiere decir que la información de su producto permanecerá inalterable para siempre

# slide3
source: This gives your customers confidence that the product in their hands is original and reliable
ca: Això dona la confiança als seus clients que el producte que tenen entre mans és original i confiable
es: Esto da la confianza a sus clientes que el producto que tienen entre manos es original y confiable

# slide4
source: A secure QR code has been generated where you can navigate to view your product information
ca: S'ha generat un codi QR segur a on podrà navegar i veure l'información del seu producte
es: Se ha generado un código QR seguro donde podrá navegar para ver la información de su producto

# pistisDemoTitle
source: Welcome to the TrustValue Lab!
ca: Benvingut al Laboratori de TrustValue!
es: ¡Bienvenido al Laboratorio de TrustValue!

# pistisDemoDesc1
source: Here you can try
ca: Aquí podràs provar
es: Aquí podrás probar

# pistisDemoDesc2
source: is our solution for the verification and traceability of blockchain-backed donations.
ca: la nostra solució per a la verificació i traçabilitat de donacions recolzades a la Blockchain.
es: nuestra solución para la verificación y trazabilidad de donaciones respaldadas en la Blockchain.

# pistisDemoDesc3
source: We are going to simulate a donation to the TrustValue Foundation. You can change the name and the amount
ca: Vamos a simular una donación a la fundación TrustValue. Puedes cambiar el nombre y el importe
es: Vamos a simular una donación a la fundación TrustValue. Puedes cambiar el nombre y el importe

# productNameError
source: Your name cannot be empty
ca: El teu nom no pot quedar buit
es: Tú nombre no puede estar vacío

# refreshPistis
source: Refresh
ca: Refrescar
es: Refrescar

# serviceTrack1
source: {amount}€ will be received on {date}
ca: El {date} es rep {amount}€
es: El {date} se reciben {amount}€

# serviceTrack2
source: On {date}, {amount}€ will be sent to the Alegria project
ca: El {date} s'envien {amount}€ al projecte Alegria
es: El {date} se envían {amount}€ a proyecto Alegria

# serviceTrack3
source: On {date}, {amount}€ will be sent to the Eco project
ca: El {date} s'envien {amount}€ a proyecto Eco
es: El {date} se envían {amount}€ a proyecto Eco

# trustUs
source: Who trust us
ca: Confien en nosaltres
es: Confían en nosotros
